/*
 * SSD1306/CH1115以及兼容的屏幕驱动
 * 作者: LittleLeaf All rights reserved
 * 版本: V1.0.0T
 * 修订日期: 2024 09 12
 * 修订日志:
 * N/A
 */
#ifndef __LLOS_SSD1306_H
#define __LLOS_SSD1306_H

#include <llos.h>

#ifdef __cplusplus
 extern "C" {
#endif

enum ll_SSD1306_cmdType_t
{
	ll_SSD1306_cmd_Cmd,
	ll_SSD1306_cmd_Data = !ll_SSD1306_cmd_Cmd,
};
enum ll_SSD1306_screenType_t
{
	ll_SSD1306_screenType_128x64,
	ll_SSD1306_screenType_128x32,
};
enum ll_SSD1306_screen_xOffset_t
{
	ll_SSD1306_screen_xOffset_0_96 = 0,
	ll_SSD1306_screen_xOffset_1_3 = 2,
};
enum ll_SSD1306_sizeFont_t
{
	ll_SSD1306_sizeFont_6x8 = 8,
	ll_SSD1306_sizeFont_8x16 = 16,
};

typedef struct
{
	enum ll_SSD1306_screenType_t type;
	enum ll_SSD1306_screen_xOffset_t xOffset;
	uint8_t isMirrot;
	uint8_t isInvert;
	uint8_t isInvertPhase;
	uint8_t brightness;
}ll_SSD1306_screenConfig_t;

/*====================================================================================
 * 函数指针类型: ll_I8080_WriteByteCB_t
 * 描述: 写字节回调函数
 * 参数:
 * 		data: 要写入的数据
 * 		cmd: 写命令还是写数据
 ====================================================================================*/
typedef void (*ll_I8080_WriteByteCB_t)(uint8_t data, enum ll_SSD1306_cmdType_t cmd);

/*====================================================================================
 * 函数指针类型: ll_I8080_DMACB_t
 * 描述: DMA回调函数
 * 参数:
 * 		pic: 图片字模首地址
*		len：要写入的字节数
 ====================================================================================*/
typedef void (*ll_I8080_DMAWriteCB_t)(const uint8_t *pic, uint32_t len);

/*====================================================================================
 * 函数名: LLOS_SSD1306_Init
 * 描述: 注册相关回调函数和设置屏幕参数
 * 参数:
 * 		I8080_WriteByteCB: 写字节回调函数
 *		I8080_DMAWriteCB：DMA写回调函数，注册回调后LLOS_SSD1306_DrawPic为DMA模式
 * 		screenConfig: 屏幕参数
 ====================================================================================*/
void LLOS_SSD1306_Init(ll_I8080_WriteByteCB_t I8080_WriteByteCB, ll_I8080_DMAWriteCB_t I8080_DMAWriteCB, ll_SSD1306_screenConfig_t *screenConfig);

/*====================================================================================
 * 函数名: LLOS_SSD1306_ScreenEN
 * 描述: 开关屏幕显示
 ====================================================================================*/
void LLOS_SSD1306_ScreenEN(ll_newState_t newState);

/*====================================================================================
 * 函数名: LLOS_SSD1306_Fill
 * 描述: 用color填满屏幕
 ====================================================================================*/
void LLOS_SSD1306_Fill(uint16_t color);

/*====================================================================================
 * 函数名: LLOS_SSD1306_SetPos
 * 描述: 设置坐标, x(0-127), y(0-7)
 ====================================================================================*/
void LLOS_SSD1306_SetPos(uint16_t x, uint16_t y);

/*====================================================================================
 * 函数名: LLOS_SSD1306_DrawPic
 * 描述: 绘图
 * 参数:
 * 		xywh: 坐标(x, y)和大小(宽度和高度)，DMA模式下无效，为整屏绘制
 * 		pic: 图片字模首地址
 ====================================================================================*/
void LLOS_SSD1306_DrawPic(uint16_t x, uint16_t y, uint16_t w, uint16_t h, const uint8_t *pic);

/*====================================================================================
 * 函数名: LLOS_SSD1306_GetSize
 * 描述: 获取屏幕尺寸
 * 参数:
 * 		w: 宽
 * 		h: 高
 ====================================================================================*/
void LLOS_SSD1306_GetSize(uint16_t *w, uint16_t *h);

/*====================================================================================
 * 函数名: LLOS_SSD1306_ShowNumFormat
 * 描述: 显示数字带格式控制
 * 参数:
 *		x, y：x(0-127), y(0-7)
 * 		num: 要显示的数字
 * 		str: 格式控制符
 *		sizeFont：字体尺寸
 ====================================================================================*/
void LLOS_SSD1306_ShowNumFormat(uint16_t x, uint16_t y, uint32_t num, const char *str, enum ll_SSD1306_sizeFont_t sizeFont);

/*====================================================================================
 * 函数名: LLOS_SSD1306_ShowString
 * 描述: 显示中英文字符串(16x16/8x16 (UTF-8))
 * 参数:
 *		x, y：x(0-127), y(0-7)
 * 		str: 要显示的字符串，支持自动换行，\r\n换行
 ====================================================================================*/
void LLOS_SSD1306_ShowString(uint16_t x, uint16_t y, const char *str);

/*====================================================================================
 * 函数名: LLOS_SSD1306_DrawDot
 * 描述: 画点
 ====================================================================================*/
void LLOS_SSD1306_DrawDot(uint16_t x, uint16_t y);

/*====================================================================================
 * 函数名: LLOS_SSD1306_DrawLine
 * 描述: 画线
 ====================================================================================*/
void LLOS_SSD1306_DrawLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2);

/*====================================================================================
 * 函数名: LLOS_SSD1306_DrawRectangle
 * 描述: 画矩形
 * 参数:
 *		isFill：是否填充
 ====================================================================================*/
void LLOS_SSD1306_DrawRectangle(uint16_t x, uint16_t y, uint16_t w, uint16_t h, ll_newState_t isFill);

/*====================================================================================
 * 函数名: LLOS_SSD1306_DrawRoundedRectangle
 * 描述: 画圆角矩形
 * 参数:
 *		isFill：是否填充
 ====================================================================================*/
void LLOS_SSD1306_DrawRoundedRectangle(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t r, ll_newState_t isFill);

/*====================================================================================
 * 函数名: LLOS_SSD1306_DrawCircle
 * 描述: 画圆形
 * 参数:
 *		isFill：是否填充
 ====================================================================================*/
void LLOS_SSD1306_DrawCircle(uint16_t x, uint16_t y, uint16_t r, ll_newState_t isFill);

/*====================================================================================
 * 函数名: LLOS_SSD1306_DrawTriangle
 * 描述: 画三角形
 * 参数:
 *		isFill：是否填充
 ====================================================================================*/
void LLOS_SSD1306_DrawTriangle(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t x3, uint16_t y3, ll_newState_t isFill);

#ifdef __cplusplus
 }
#endif

#endif /* __LLOS_SSD1306_H */
